# by: t.me/Mikthon
soursce = """
**
مرحبًا بك في سورس مكثون
- القناة الرسمية : @isAndreew
- المطور : @none
**
"""
commands = """
**
الاوامر :
.اكس او
.ادمن
.اذاعة كروب
.اذاعة خاص
.الاوامر
.فحص
.م1
.م2
.م3
.م4
.م5
.الاوامر الخاصة
.البنك
.غادر
.اعادة تشغيل
.اشتراكاتي
.المطور
.انهاء الاسم الوقتي
.اسم وقتي
.انهاء البايو الوقتي
.بايو وقتي
.بايو
.تفليش
.هممم
**
"""
sec1 = """
**
اذاعة كروب - لنشر رسالة في جميع الكروبات
اذاعة خاص - لنشر رسالة في جميع الخاص
تفليش - لمسح جميع الصلاحيات من جميع الأعضاء
**
"""
sec2 = """
**
م1 - اوامر قسم الاذاعة والتفليش
م2 - اوامر قسم الاوامر الخاصة
م3 - اوامر قسم البنك
م4 - اوامر قسم المغادرة
م5 - اوامر قسم الاسم والوقت
**
"""
sec3 = """
**
.البنك
**
"""
sec4 = """
**
.غادر - لمغادرة المجموعة
**
"""
sec5 = """
**
.انهاء الاسم الوقتي - لإيقاف تحديث الاسم
.اسم وقتي - لتفعيل تحديث الاسم حسب الوقت
.انهاء البايو الوقتي - لإيقاف تحديث البايو
.بايو وقتي - لتفعيل تحديث البايو حسب الوقت
**
"""
spc = """
**
.صيد + النوع
.حالة الصيد
.الاوامر الخاصة
**
"""
spc2 = """
**
.صيد + النوع
.حالة الصيد
.تثبيت + المعرف
.حالة التثبيت
.الاوامر الخاصة
**
"""
tele_checker = """
**
**-- -- -- -- -- -- -- -- --
رباعي { s_xxx - عشوائي }
رباعي1 { s_xxx - حروف }
رباعي2 { s7_77 - ارقام }
رباعي3  { ss_77 - عشوائي }
رباعي4 { ss_xx - حروف }
رباعي5 { ss_88 - ارقام }
ثلاثي { s_c_i - عشوائي }
ثلاثي2 { s_x_7 - s_8_x }

طريقه الصيد هيه كالتالي
- .صيد + نوع الصيد تكتب الاسم 
هوه ينشأ قناة تلقائي ويفحص بيها
-- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- 
مثال: .صيد ثلاثي
---------------------------------------------------------------------- — — — —
الامر:  `.صيد` + النوع
- يقوم بصيد معرفات عشوائية حسب النوع

ٴ— — — — — — — — — —
الامر:   `.حالة الصيد`
• لمعرفة عدد المحاولات للصيد

@fcf30 
 حرف او اوقام وحروف
**
"""
tele_checker2 = """
**
**-- -- -- -- -- -- -- -- --
رباعي { s_xxx - عشوائي }
رباعي1 { s_xxx - حروف }
رباعي2 { s7_77 - ارقام }
رباعي3  { ss_77 - عشوائي }
رباعي4 { ss_xx - حروف }
رباعي5 { ss_88 - ارقام }
ثلاثي { s_c_i - عشوائي }
ثلاثي2 { s_x_7 - s_8_x }

طريقه الصيد هيه كالتالي
- .صيد + نوع الصيد تكتب الاسم 
هوه ينشأ قناة تلقائي ويفحص بيها
-- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- 
مثال: .صيد ثلاثي
---------------------------------------------------------------------- — — — —
الامر:  `.صيد` + النوع
- يقوم بصيد معرفات عشوائية حسب النوع

ٴ— — — — — — — — — —
الامر:   `.حالة الصيد`
• لمعرفة عدد المحاولات للصيد

@fcf30 

"""